Revit 2024 API
DividedPath.SetIntersectingElements Method
 Set the elements whose intersection with path produces points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetIntersectingElements(
	ICollection<ElementId> intersectors
)
Visual Basic
Public Sub SetIntersectingElements ( _
	intersectors As ICollection(Of ElementId) _
)
Visual C++
public:
void SetIntersectingElements(
	ICollection<ElementId^>^ intersectors
)
Parameters
intersectors
Type: System.Collections.Generic.ICollection<ElementId>
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Not all intersecting elements in intersectors are valid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DividedPath Class
Autodesk.Revit.DB Namespace